{"format": "layers-model", "generatedBy": "keras v2.10.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.10.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "Transformer_encoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_layer"}, "name": "input_layer", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 30001, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_1", "inbound_nodes": [[["input_layer", 0, 0, {}]]]}, {"class_name": "AddPositionalEncoding", "config": {"embed_dim": 50}, "name": "add_positional_encoding_1", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "self-attention_0", "trainable": true, "dtype": "float32", "num_heads": 8, "key_dim": 50, "value_dim": 50, "dropout": 0.3, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 50], "key_shape": [null, 100, 50], "value_shape": [null, 100, 50]}, "name": "self-attention_0", "inbound_nodes": [[["add_positional_encoding_1", 0, 0, {"value": ["add_positional_encoding_1", 0, 0], "key": ["add_positional_encoding_1", 0, 0]}]]]}, {"class_name": "Add", "config": {"name": "add_8", "trainable": true, "dtype": "float32"}, "name": "add_8", "inbound_nodes": [[["add_positional_encoding_1", 0, 0, {}], ["self-attention_0", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_4", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_4", "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "internal_dense_in_0", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "internal_dense_in_0", "inbound_nodes": [[["layer_normalization_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "internal_dense_out_0", "trainable": true, "dtype": "float32", "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "internal_dense_out_0", "inbound_nodes": [[["internal_dense_in_0", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_5", "inbound_nodes": [[["internal_dense_out_0", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_9", "trainable": true, "dtype": "float32"}, "name": "add_9", "inbound_nodes": [[["layer_normalization_4", 0, 0, {}], ["dropout_5", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "self-attention_1", "trainable": true, "dtype": "float32", "num_heads": 8, "key_dim": 50, "value_dim": 50, "dropout": 0.3, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 50], "key_shape": [null, 100, 50], "value_shape": [null, 100, 50]}, "name": "self-attention_1", "inbound_nodes": [[["add_9", 0, 0, {"value": ["add_9", 0, 0], "key": ["add_9", 0, 0]}]]]}, {"class_name": "Add", "config": {"name": "add_10", "trainable": true, "dtype": "float32"}, "name": "add_10", "inbound_nodes": [[["add_9", 0, 0, {}], ["self-attention_1", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_5", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_5", "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "internal_dense_in_1", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "internal_dense_in_1", "inbound_nodes": [[["layer_normalization_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "internal_dense_out_1", "trainable": true, "dtype": "float32", "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "internal_dense_out_1", "inbound_nodes": [[["internal_dense_in_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_6", "inbound_nodes": [[["internal_dense_out_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_11", "trainable": true, "dtype": "float32"}, "name": "add_11", "inbound_nodes": [[["layer_normalization_5", 0, 0, {}], ["dropout_6", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "self-attention_2", "trainable": true, "dtype": "float32", "num_heads": 8, "key_dim": 50, "value_dim": 50, "dropout": 0.3, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 50], "key_shape": [null, 100, 50], "value_shape": [null, 100, 50]}, "name": "self-attention_2", "inbound_nodes": [[["add_11", 0, 0, {"value": ["add_11", 0, 0], "key": ["add_11", 0, 0]}]]]}, {"class_name": "Add", "config": {"name": "add_12", "trainable": true, "dtype": "float32"}, "name": "add_12", "inbound_nodes": [[["add_11", 0, 0, {}], ["self-attention_2", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_6", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_6", "inbound_nodes": [[["add_12", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "internal_dense_in_2", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "internal_dense_in_2", "inbound_nodes": [[["layer_normalization_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "internal_dense_out_2", "trainable": true, "dtype": "float32", "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "internal_dense_out_2", "inbound_nodes": [[["internal_dense_in_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_7", "inbound_nodes": [[["internal_dense_out_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_13", "trainable": true, "dtype": "float32"}, "name": "add_13", "inbound_nodes": [[["layer_normalization_6", 0, 0, {}], ["dropout_7", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "self-attention_3", "trainable": true, "dtype": "float32", "num_heads": 8, "key_dim": 50, "value_dim": 50, "dropout": 0.3, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 50], "key_shape": [null, 100, 50], "value_shape": [null, 100, 50]}, "name": "self-attention_3", "inbound_nodes": [[["add_13", 0, 0, {"value": ["add_13", 0, 0], "key": ["add_13", 0, 0]}]]]}, {"class_name": "Add", "config": {"name": "add_14", "trainable": true, "dtype": "float32"}, "name": "add_14", "inbound_nodes": [[["add_13", 0, 0, {}], ["self-attention_3", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_7", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_7", "inbound_nodes": [[["add_14", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "internal_dense_in_3", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "internal_dense_in_3", "inbound_nodes": [[["layer_normalization_7", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "internal_dense_out_3", "trainable": true, "dtype": "float32", "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "internal_dense_out_3", "inbound_nodes": [[["internal_dense_in_3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_8", "inbound_nodes": [[["internal_dense_out_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_15", "trainable": true, "dtype": "float32"}, "name": "add_15", "inbound_nodes": [[["layer_normalization_7", 0, 0, {}], ["dropout_8", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "dtype": "float32", "filters": 25, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_1", "inbound_nodes": [[["add_15", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_1", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_9", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["dropout_9", 0, 0, {}]]]}], "input_layers": [["input_layer", 0, 0]], "output_layers": [["dense_3", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 9.999999747378752e-06, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "conv1d_1/kernel", "shape": [1, 50, 25], "dtype": "float32"}, {"name": "conv1d_1/bias", "shape": [25], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [2500, 512], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [512, 1], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_1/embeddings", "shape": [30001, 50], "dtype": "float32"}, {"name": "internal_dense_in_0/kernel", "shape": [50, 512], "dtype": "float32"}, {"name": "internal_dense_in_0/bias", "shape": [512], "dtype": "float32"}, {"name": "internal_dense_in_1/kernel", "shape": [50, 512], "dtype": "float32"}, {"name": "internal_dense_in_1/bias", "shape": [512], "dtype": "float32"}, {"name": "internal_dense_in_2/kernel", "shape": [50, 512], "dtype": "float32"}, {"name": "internal_dense_in_2/bias", "shape": [512], "dtype": "float32"}, {"name": "internal_dense_in_3/kernel", "shape": [50, 512], "dtype": "float32"}, {"name": "internal_dense_in_3/bias", "shape": [512], "dtype": "float32"}, {"name": "internal_dense_out_0/kernel", "shape": [512, 50], "dtype": "float32"}, {"name": "internal_dense_out_0/bias", "shape": [50], "dtype": "float32"}, {"name": "internal_dense_out_1/kernel", "shape": [512, 50], "dtype": "float32"}, {"name": "internal_dense_out_1/bias", "shape": [50], "dtype": "float32"}, {"name": "internal_dense_out_2/kernel", "shape": [512, 50], "dtype": "float32"}, {"name": "internal_dense_out_2/bias", "shape": [50], "dtype": "float32"}, {"name": "internal_dense_out_3/kernel", "shape": [512, 50], "dtype": "float32"}, {"name": "internal_dense_out_3/bias", "shape": [50], "dtype": "float32"}, {"name": "layer_normalization_4/gamma", "shape": [50], "dtype": "float32"}, {"name": "layer_normalization_4/beta", "shape": [50], "dtype": "float32"}, {"name": "layer_normalization_5/gamma", "shape": [50], "dtype": "float32"}, {"name": "layer_normalization_5/beta", "shape": [50], "dtype": "float32"}, {"name": "layer_normalization_6/gamma", "shape": [50], "dtype": "float32"}, {"name": "layer_normalization_6/beta", "shape": [50], "dtype": "float32"}, {"name": "layer_normalization_7/gamma", "shape": [50], "dtype": "float32"}, {"name": "layer_normalization_7/beta", "shape": [50], "dtype": "float32"}, {"name": "self-attention_0/query/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_0/query/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_0/key/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_0/key/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_0/value/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_0/value/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_0/attention_output/kernel", "shape": [8, 50, 50], "dtype": "float32"}, {"name": "self-attention_0/attention_output/bias", "shape": [50], "dtype": "float32"}, {"name": "self-attention_1/query/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_1/query/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_1/key/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_1/key/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_1/value/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_1/value/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_1/attention_output/kernel", "shape": [8, 50, 50], "dtype": "float32"}, {"name": "self-attention_1/attention_output/bias", "shape": [50], "dtype": "float32"}, {"name": "self-attention_2/query/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_2/query/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_2/key/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_2/key/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_2/value/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_2/value/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_2/attention_output/kernel", "shape": [8, 50, 50], "dtype": "float32"}, {"name": "self-attention_2/attention_output/bias", "shape": [50], "dtype": "float32"}, {"name": "self-attention_3/query/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_3/query/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_3/key/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_3/key/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_3/value/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_3/value/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_3/attention_output/kernel", "shape": [8, 50, 50], "dtype": "float32"}, {"name": "self-attention_3/attention_output/bias", "shape": [50], "dtype": "float32"}]}]}