{"format": "layers-model", "generatedBy": "keras v2.10.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.10.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "Transformer_encoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_layer"}, "name": "input_layer", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 30001, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_2", "inbound_nodes": [[["input_layer", 0, 0, {}]]]}, {"class_name": "AddPositionalEncoding", "config": {"embed_dim": 50}, "name": "add_positional_encoding_2", "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "self-attention_0", "trainable": true, "dtype": "float32", "num_heads": 8, "key_dim": 50, "value_dim": 50, "dropout": 0.3, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 50], "key_shape": [null, 100, 50], "value_shape": [null, 100, 50]}, "name": "self-attention_0", "inbound_nodes": [[["add_positional_encoding_2", 0, 0, {"value": ["add_positional_encoding_2", 0, 0], "key": ["add_positional_encoding_2", 0, 0]}]]]}, {"class_name": "Add", "config": {"name": "add_20", "trainable": true, "dtype": "float32"}, "name": "add_20", "inbound_nodes": [[["add_positional_encoding_2", 0, 0, {}], ["self-attention_0", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_9", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_9", "inbound_nodes": [[["add_20", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "internal_dense_in_0", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "internal_dense_in_0", "inbound_nodes": [[["layer_normalization_9", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "internal_dense_out_0", "trainable": true, "dtype": "float32", "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "internal_dense_out_0", "inbound_nodes": [[["internal_dense_in_0", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_17", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_17", "inbound_nodes": [[["internal_dense_out_0", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_21", "trainable": true, "dtype": "float32"}, "name": "add_21", "inbound_nodes": [[["layer_normalization_9", 0, 0, {}], ["dropout_17", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "self-attention_1", "trainable": true, "dtype": "float32", "num_heads": 8, "key_dim": 50, "value_dim": 50, "dropout": 0.3, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 50], "key_shape": [null, 100, 50], "value_shape": [null, 100, 50]}, "name": "self-attention_1", "inbound_nodes": [[["add_21", 0, 0, {"value": ["add_21", 0, 0], "key": ["add_21", 0, 0]}]]]}, {"class_name": "Add", "config": {"name": "add_22", "trainable": true, "dtype": "float32"}, "name": "add_22", "inbound_nodes": [[["add_21", 0, 0, {}], ["self-attention_1", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_10", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_10", "inbound_nodes": [[["add_22", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "internal_dense_in_1", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "internal_dense_in_1", "inbound_nodes": [[["layer_normalization_10", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "internal_dense_out_1", "trainable": true, "dtype": "float32", "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "internal_dense_out_1", "inbound_nodes": [[["internal_dense_in_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_18", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_18", "inbound_nodes": [[["internal_dense_out_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_23", "trainable": true, "dtype": "float32"}, "name": "add_23", "inbound_nodes": [[["layer_normalization_10", 0, 0, {}], ["dropout_18", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "self-attention_2", "trainable": true, "dtype": "float32", "num_heads": 8, "key_dim": 50, "value_dim": 50, "dropout": 0.3, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 50], "key_shape": [null, 100, 50], "value_shape": [null, 100, 50]}, "name": "self-attention_2", "inbound_nodes": [[["add_23", 0, 0, {"value": ["add_23", 0, 0], "key": ["add_23", 0, 0]}]]]}, {"class_name": "Add", "config": {"name": "add_24", "trainable": true, "dtype": "float32"}, "name": "add_24", "inbound_nodes": [[["add_23", 0, 0, {}], ["self-attention_2", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_11", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_11", "inbound_nodes": [[["add_24", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "internal_dense_in_2", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "internal_dense_in_2", "inbound_nodes": [[["layer_normalization_11", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "internal_dense_out_2", "trainable": true, "dtype": "float32", "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "internal_dense_out_2", "inbound_nodes": [[["internal_dense_in_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_19", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_19", "inbound_nodes": [[["internal_dense_out_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_25", "trainable": true, "dtype": "float32"}, "name": "add_25", "inbound_nodes": [[["layer_normalization_11", 0, 0, {}], ["dropout_19", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "self-attention_3", "trainable": true, "dtype": "float32", "num_heads": 8, "key_dim": 50, "value_dim": 50, "dropout": 0.3, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 50], "key_shape": [null, 100, 50], "value_shape": [null, 100, 50]}, "name": "self-attention_3", "inbound_nodes": [[["add_25", 0, 0, {"value": ["add_25", 0, 0], "key": ["add_25", 0, 0]}]]]}, {"class_name": "Add", "config": {"name": "add_26", "trainable": true, "dtype": "float32"}, "name": "add_26", "inbound_nodes": [[["add_25", 0, 0, {}], ["self-attention_3", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_12", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_12", "inbound_nodes": [[["add_26", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "internal_dense_in_3", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "internal_dense_in_3", "inbound_nodes": [[["layer_normalization_12", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "internal_dense_out_3", "trainable": true, "dtype": "float32", "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "internal_dense_out_3", "inbound_nodes": [[["internal_dense_in_3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_20", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_20", "inbound_nodes": [[["internal_dense_out_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_27", "trainable": true, "dtype": "float32"}, "name": "add_27", "inbound_nodes": [[["layer_normalization_12", 0, 0, {}], ["dropout_20", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "self-attention_4", "trainable": true, "dtype": "float32", "num_heads": 8, "key_dim": 50, "value_dim": 50, "dropout": 0.3, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 50], "key_shape": [null, 100, 50], "value_shape": [null, 100, 50]}, "name": "self-attention_4", "inbound_nodes": [[["add_27", 0, 0, {"value": ["add_27", 0, 0], "key": ["add_27", 0, 0]}]]]}, {"class_name": "Add", "config": {"name": "add_28", "trainable": true, "dtype": "float32"}, "name": "add_28", "inbound_nodes": [[["add_27", 0, 0, {}], ["self-attention_4", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_13", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_13", "inbound_nodes": [[["add_28", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "internal_dense_in_4", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "internal_dense_in_4", "inbound_nodes": [[["layer_normalization_13", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "internal_dense_out_4", "trainable": true, "dtype": "float32", "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "internal_dense_out_4", "inbound_nodes": [[["internal_dense_in_4", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_21", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_21", "inbound_nodes": [[["internal_dense_out_4", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_29", "trainable": true, "dtype": "float32"}, "name": "add_29", "inbound_nodes": [[["layer_normalization_13", 0, 0, {}], ["dropout_21", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_10", "trainable": true, "dtype": "float32", "filters": 25, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_10", "inbound_nodes": [[["add_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_10", "inbound_nodes": [[["conv1d_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_6", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_11", "trainable": true, "dtype": "float32", "filters": 25, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_11", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_11", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_11", "inbound_nodes": [[["conv1d_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_7", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_12", "trainable": true, "dtype": "float32", "filters": 25, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_12", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_12", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_12", "inbound_nodes": [[["conv1d_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_13", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_13", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_30", "trainable": true, "dtype": "float32"}, "name": "add_30", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_8", "inbound_nodes": [[["add_30", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14", "trainable": true, "dtype": "float32", "filters": 25, "kernel_size": [8], "strides": [4], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_14", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_14", "inbound_nodes": [[["conv1d_14", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_2", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_6", "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_22", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_22", "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_7", "inbound_nodes": [[["dropout_22", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_23", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_23", "inbound_nodes": [[["dense_7", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_8", "inbound_nodes": [[["dropout_23", 0, 0, {}]]]}], "input_layers": [["input_layer", 0, 0]], "output_layers": [["dense_8", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 9.999999747378752e-06, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "batch_normalization_10/gamma", "shape": [25], "dtype": "float32"}, {"name": "batch_normalization_10/beta", "shape": [25], "dtype": "float32"}, {"name": "batch_normalization_10/moving_mean", "shape": [25], "dtype": "float32"}, {"name": "batch_normalization_10/moving_variance", "shape": [25], "dtype": "float32"}, {"name": "batch_normalization_11/gamma", "shape": [25], "dtype": "float32"}, {"name": "batch_normalization_11/beta", "shape": [25], "dtype": "float32"}, {"name": "batch_normalization_11/moving_mean", "shape": [25], "dtype": "float32"}, {"name": "batch_normalization_11/moving_variance", "shape": [25], "dtype": "float32"}, {"name": "batch_normalization_12/gamma", "shape": [25], "dtype": "float32"}, {"name": "batch_normalization_12/beta", "shape": [25], "dtype": "float32"}, {"name": "batch_normalization_12/moving_mean", "shape": [25], "dtype": "float32"}, {"name": "batch_normalization_12/moving_variance", "shape": [25], "dtype": "float32"}, {"name": "batch_normalization_13/gamma", "shape": [25], "dtype": "float32"}, {"name": "batch_normalization_13/beta", "shape": [25], "dtype": "float32"}, {"name": "batch_normalization_13/moving_mean", "shape": [25], "dtype": "float32"}, {"name": "batch_normalization_13/moving_variance", "shape": [25], "dtype": "float32"}, {"name": "batch_normalization_14/gamma", "shape": [25], "dtype": "float32"}, {"name": "batch_normalization_14/beta", "shape": [25], "dtype": "float32"}, {"name": "batch_normalization_14/moving_mean", "shape": [25], "dtype": "float32"}, {"name": "batch_normalization_14/moving_variance", "shape": [25], "dtype": "float32"}, {"name": "conv1d_10/kernel", "shape": [1, 50, 25], "dtype": "float32"}, {"name": "conv1d_10/bias", "shape": [25], "dtype": "float32"}, {"name": "conv1d_11/kernel", "shape": [1, 25, 25], "dtype": "float32"}, {"name": "conv1d_11/bias", "shape": [25], "dtype": "float32"}, {"name": "conv1d_12/kernel", "shape": [1, 25, 25], "dtype": "float32"}, {"name": "conv1d_12/bias", "shape": [25], "dtype": "float32"}, {"name": "conv1d_14/kernel", "shape": [8, 25, 25], "dtype": "float32"}, {"name": "conv1d_14/bias", "shape": [25], "dtype": "float32"}, {"name": "dense_6/kernel", "shape": [600, 512], "dtype": "float32"}, {"name": "dense_6/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_7/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "dense_7/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_8/kernel", "shape": [256, 1], "dtype": "float32"}, {"name": "dense_8/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_2/embeddings", "shape": [30001, 50], "dtype": "float32"}, {"name": "internal_dense_in_0/kernel", "shape": [50, 512], "dtype": "float32"}, {"name": "internal_dense_in_0/bias", "shape": [512], "dtype": "float32"}, {"name": "internal_dense_in_1/kernel", "shape": [50, 512], "dtype": "float32"}, {"name": "internal_dense_in_1/bias", "shape": [512], "dtype": "float32"}, {"name": "internal_dense_in_2/kernel", "shape": [50, 512], "dtype": "float32"}, {"name": "internal_dense_in_2/bias", "shape": [512], "dtype": "float32"}, {"name": "internal_dense_in_3/kernel", "shape": [50, 512], "dtype": "float32"}, {"name": "internal_dense_in_3/bias", "shape": [512], "dtype": "float32"}, {"name": "internal_dense_in_4/kernel", "shape": [50, 512], "dtype": "float32"}, {"name": "internal_dense_in_4/bias", "shape": [512], "dtype": "float32"}, {"name": "internal_dense_out_0/kernel", "shape": [512, 50], "dtype": "float32"}, {"name": "internal_dense_out_0/bias", "shape": [50], "dtype": "float32"}, {"name": "internal_dense_out_1/kernel", "shape": [512, 50], "dtype": "float32"}, {"name": "internal_dense_out_1/bias", "shape": [50], "dtype": "float32"}, {"name": "internal_dense_out_2/kernel", "shape": [512, 50], "dtype": "float32"}, {"name": "internal_dense_out_2/bias", "shape": [50], "dtype": "float32"}, {"name": "internal_dense_out_3/kernel", "shape": [512, 50], "dtype": "float32"}, {"name": "internal_dense_out_3/bias", "shape": [50], "dtype": "float32"}, {"name": "internal_dense_out_4/kernel", "shape": [512, 50], "dtype": "float32"}, {"name": "internal_dense_out_4/bias", "shape": [50], "dtype": "float32"}, {"name": "layer_normalization_10/gamma", "shape": [50], "dtype": "float32"}, {"name": "layer_normalization_10/beta", "shape": [50], "dtype": "float32"}, {"name": "layer_normalization_11/gamma", "shape": [50], "dtype": "float32"}, {"name": "layer_normalization_11/beta", "shape": [50], "dtype": "float32"}, {"name": "layer_normalization_12/gamma", "shape": [50], "dtype": "float32"}, {"name": "layer_normalization_12/beta", "shape": [50], "dtype": "float32"}, {"name": "layer_normalization_13/gamma", "shape": [50], "dtype": "float32"}, {"name": "layer_normalization_13/beta", "shape": [50], "dtype": "float32"}, {"name": "layer_normalization_9/gamma", "shape": [50], "dtype": "float32"}, {"name": "layer_normalization_9/beta", "shape": [50], "dtype": "float32"}, {"name": "self-attention_0/query/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_0/query/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_0/key/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_0/key/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_0/value/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_0/value/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_0/attention_output/kernel", "shape": [8, 50, 50], "dtype": "float32"}, {"name": "self-attention_0/attention_output/bias", "shape": [50], "dtype": "float32"}, {"name": "self-attention_1/query/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_1/query/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_1/key/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_1/key/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_1/value/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_1/value/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_1/attention_output/kernel", "shape": [8, 50, 50], "dtype": "float32"}, {"name": "self-attention_1/attention_output/bias", "shape": [50], "dtype": "float32"}, {"name": "self-attention_2/query/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_2/query/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_2/key/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_2/key/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_2/value/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_2/value/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_2/attention_output/kernel", "shape": [8, 50, 50], "dtype": "float32"}, {"name": "self-attention_2/attention_output/bias", "shape": [50], "dtype": "float32"}, {"name": "self-attention_3/query/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_3/query/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_3/key/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_3/key/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_3/value/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_3/value/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_3/attention_output/kernel", "shape": [8, 50, 50], "dtype": "float32"}, {"name": "self-attention_3/attention_output/bias", "shape": [50], "dtype": "float32"}, {"name": "self-attention_4/query/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_4/query/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_4/key/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_4/key/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_4/value/kernel", "shape": [50, 8, 50], "dtype": "float32"}, {"name": "self-attention_4/value/bias", "shape": [8, 50], "dtype": "float32"}, {"name": "self-attention_4/attention_output/kernel", "shape": [8, 50, 50], "dtype": "float32"}, {"name": "self-attention_4/attention_output/bias", "shape": [50], "dtype": "float32"}]}]}